# ViewSheetViewportInfo Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSheetViewportInfo Property
ParameterTypeId Class See Also
---
"Viewport"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSheetViewportInfo { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSheetViewportInfo As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSheetViewportInfo {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace